label ch2:
    stop music
    voice "voice/awei2-1.ogg"
    w "弱耶，拜托你很弱耶！你现在知道谁是老大了喔？哈！"
    "阿伟指着电脑说着，阿伟的阿嬤听到了，便从房间内走了出来。"
    scene awei ama
    voice "voice/ama2-1.ogg"
    am "阿伟你又在玩电动喔？休息一下吧？去看个书好不好？"
    w "烦耶。"
    am "我在跟你讲话你有没有听到？"
    w "你不要烦好不好！"
    am "我才讲你两句你就说我烦？我只希望你能够好好用功读书，整天只看到你在这边打电动！"
    w "吼！死了啦，都你害的啦，拜托。"
    scene ama
    "阿伟生气着冲出了家门。"
    w "（那天，我只是因为受不了阿嬷啰嗦，就冲出去，谁知道，竟然......）"
    scene wangba
    with fade
    "网吧。"
    w "他超废的耶！"
    b "我知道啊。之前我就干掉他过。"
    w "二班那个啊！他每次都被我洗战绩耶。"
    scene jiege kanyiyan
    "阿伟和彬彬打着电动。一旁的男子转过身来，看了他们一眼。"
    "......"
    scene wab wangba
    b "我死了，我不要玩了。"
    w "欸。你不要每次都这样好不好？"
    b "不想玩了啦。"
    pause 1.9
    w "你还有没有钱啊？我肚子好饿。"
    b "没了啦，今天都花光了。"
    scene jiege kanyiyan
    "一旁的男子再次转过身看了他们一眼。"
    "那男子起身，走出了网吧。"
    b "好啦，时间也差不多了，也该回家了。"
    "......"
    scene wuwai
    with fade
    "两人走出了网吧。"
    w "彬彬，我好饿喔。我们两个都没钱了。"
    b "没有钱我们就只能回家。"
    w "拜托！我才不要回家咧，我阿嬷超凶的。"
    voice "voice/jiege1.ogg"
    unk "不好意思...我刚听到你们两个说肚子饿，我这里刚好有块面包，我还不饿，请你们吃。"
    "那男子向两人搭话，并递给了他们一块面包。"
    "两人接过面包，迫不及待地撕下面包，吃了起来。"
    unk "对了，我叫阿杰，我也常来这里玩，嗯，他们都叫我杰哥。"
    "阿伟&彬彬" "杰哥好。"
    "两人抬起了头，互相看了几眼，便慌忙向杰哥鞠了躬，便再次拿起面包吃了起来。"
    scene jiege chujian
    j "诶，你们好。我一个人住，我的房子还蛮大的，欢迎你们来我家玩。玩累了就...直接睡觉，没问题的。"
    scene wab huaiyi
    w "你觉得呢？"
    b "我觉得，怪怪的。"
    w "看起来就是个很奇怪的人啊！不要理他。"
    "阿伟&彬彬" "不要去不要去。"
    scene jiege chujian
    j "诶诶...我常常帮助一些翘家的人，如果你们不要来的话，也没有关系。如果要来的话，我等一下可以带你们去超商，买一些好吃的喔。"
    scene wab huaiyi
    w "有东西可以吃耶！要不要去啊？"
    "彬彬犹豫了一会。但他无法抵御食物的诱惑，便决定和和杰哥一起去。"
    b "好啦，不然去好了。"
    scene jiege chujian
    "杰哥露出了笑容。"
    scene wab huaiyi
    w "那杰哥！我和我朋友今天就去住你家咯！"
    scene jiege chujian
    j "好啊，没问题啊！那走啊！我们现在就去超商买一些吃的！"
    scene chaoshang
    "三人一起去了超商，买了很多吃的和饮料。"
    "杰哥并不吝啬自己的钱包，任由二人买东西。"
    "杰哥拿起了货架上的一些啤酒，看了几眼..."
    "又将目光投向了挑选饮料的二人。"
    "杰哥露出了笑容，再在货架上拿了一些啤酒。"
    scene wanshang
    with fade
    "晚上。"
    scene jiegejia
    with fade
    voice "voice/b2-1.ogg"
    b "快哉啊——————！快哉，快————哉————啊！"
    "彬彬瘫倒在沙发上，两臂拍打着沙发。"
    voice "voice/jiege2-1.ogg"
    j "你看，你看这个彬彬，才喝几罐，就醉了！真的太逊了！"
    voice "voice/awei3-1.ogg"
    w "这个彬彬就是逊啦！"
    voice "voice/jiege2-2.ogg"
    j "嗯？听你这么说，你很勇哦？"
    voice "voice/awei3-2.ogg"
    w "开玩笑，我超勇的好不好！我超会喝的啦！"
    "杰哥把手放在了阿伟的腿上。"
    voice "voice/jiege2-3.ogg"
    j "超会喝，很勇嘛？身材不错哦，蛮结实的啊？"
    w "杰哥，你干嘛啊？"
    j "都几岁了，还那么害羞？我看你完全是不懂喔？"
    w "懂，懂什么啊？"
    j "你想懂，我房里有一些好康的。"
    w "好康？是新游戏喔？"
    j "什么新游戏，比游戏还刺激！还可以教你......登dua郎。"
    w "登dua郎？"
    j "对啊。来啊，来看就知道了！"
    "阿伟被杰哥拉向了卧室，一旁的彬彬仍醉倒在沙发上，此时的他，完全不知道，后来发生了什么......。"
    scene woshi
    with fade
    w "杰哥，你有好多A片喔。"
    j "哎呦，那没什么，来看这个好康的！"
    "杰哥点击了电脑，屏幕上显示出一个画面......"
    "阿伟靠近了看，似乎不知道这是什么内容，但他的脸出卖了他。"
    w "杰哥，这是什么啊？"
    pause 1
    j "哎呦，你脸红啦？来，让我看看。"
    w "不要啦！"
    j "让我看看。"
    w "不要啦！杰哥，你干嘛啊？"
    j "让我看看你发育正不正常啊！"
    "杰哥突然做出可疑的举动。"
    w "杰哥，不要啦！"
    "阿伟推开了杰哥。"
    scene jiege zhaijing
    with fade
    "杰哥摘下了眼镜，放在桌子上。"
    pause 2
    j "听话......"
    j "让我看看！"
    scene awei buyao
    w "不要！"
    scene jiege quantou
    "杰哥突然一拳打在阿伟的头部，打倒了阿伟，便立刻袭击阿伟，强行脱下了他的衣服。"
    w "杰哥不要啦，杰哥不要——！"
    scene awei luo
    w "杰哥不要————！杰哥————！杰哥不要！"
    with fade
    $ renpy.movie_cutscene("awei_shihou.mp4")
return